'use strict'

a === 0 ? 'Верно' : 'Неверно'
a > 0 ? 'Верно' : 'Неверно'
a < 0 ? 'Верно' : 'Неверно'
a >= 0 ? 'Верно' : 'Неверно'
a <= 0 ? 'Верно' : 'Неверно'
a !== 0 ? 'Верно' : 'Неверно'
a === 'test' ? 'Верно' : 'Неверно'
a === '1' ? 'Верно' : 'Неверно'
a > 0 && a < 5 ? 'Верно' : 'Неверно'
a === 0 || a === 2 ? a + 7 : a / 10
a <= 1 && a >= 3 ? a + b : a - b
(a > 2 && a < 11) || (b >= 6 && b < 14) ? 'Верно' : 'Неверно'

let result
switch (num) {
    case 1:
        result = 'зима'
        break;
    case 2:
        result = 'весна'
        break;
    case 3:
        result = 'літо'
        break;
    case 4:
        result = 'осінь'
        break;
    default;
        result = 'Значення num не відповідає жодній порі року';
}

