'use strict'

const year = prompt('В якому році ви народились?')
const city = prompt('В якому місті ви мешкаєте?')
const sport = prompt('Який у вас улюблений вид спорту?')
const first = year ? `В ${year}.` : 'Жаль, що ти не ввів свій рік нарождення.'
const second = city ?
    (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') ?
        `Ти живеш у столиці ${city}.` :
        `Ти живеш у місті ${city}.` :
    'Жаль, що ти не ввів своє місто';
const third = sport ?
    `Круто! Хочеш стати ${sport === 'Плавання' ? 'Майкл Фелпс' : sport === 'Футбол' ? 'Криштиану Роналду' : sport === 'Теніс' ? 'А. Зверев' : 'чемпионом'}?` :
    'Жаль, що ти не ввів улюблений вид спорту.';

alert(`${first}\n${second}\n${third}`)

// // if (sport === 'Плавання' || sport === 'Футбол' || sport === 'Теніс')
//
// if (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') {
//     alert(`В ${year},\nТи живеш у столиці ${city},\nКруто! Хочеш стати ${sport === 'Плавання' ? 'Майкл Фелпс' : sport === 'Футбол' ? 'Криштиану Роналду' : sport === 'Теніс' ? 'А. Зверев' : 'чемпионом'}?`)
// } else {
//     alert(`В ${year},\nТи живеш у місті ${city},\nКруто! Хочеш стати ${sport === 'Плавання' ? 'Майкл Фелпс' : sport === 'Футбол' ? 'Криштиану Роналду' : sport === 'Теніс' ? 'А. Зверев' : 'чемпионом'}?`)
// }
